In [1]:
import pandas as pd

In [2]:
loan_df = pd.read_csv('data/loan.csv')
loan_df

,loan_id,married_or_not,self_employed_or_not,applicant_income,loan_amount,property_area,loan_status
0,LP1003,Y,N,4583,128.4,Rural,N
1,LP1005,Y,Y,3000,66.0,City,Y
2,LP1006,Y,N,2583,120.5,City,Y
3,LP1008,N,N,6000,141.4,City,Y
4,LP1011,Y,Y,5417,267.4,City,Y
...,...,...,...,...,...,...,...
595,LP2974,Y,N,3232,108.6,Rural,Y
596,LP2979,Y,N,4106,40.7,Rural,Y
597,LP2983,Y,N,8072,253.4,City,Y
598,LP2984,Y,N,7583,187.6,City,Y
599,LP2990,N,Y,4583,133.2,Suburb,N

In [4]:
condition1 = loan_df['married_or_not'] == 'Y'

In [5]:
loan_df['applicant_income'].mean()

5412.161666666667

In [6]:
loan_df = loan_df.set_index('loan_id')

In [7]:
loan_df.columns

Index(['married_or_not', 'self_employed_or_not', 'applicant_income',
       'loan_amount', 'property_area', 'loan_status'],
      dtype='object')

In [8]:
loan_df.columns = ['married', 'self_employed', 'income', 'amount', 'property_area', 'loan_status']
loan_df

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[600 rows x 6 columns]

In [9]:
condition1 = loan_df['married'] == 'Y'

In [10]:
loan_df['income'].mean()

5412.161666666667

In [11]:
condition2 = loan_df['income'] > loan_df['income'].mean()

In [12]:
loan_df[condition1 & condition2]

        married self_employed  income  amount property_area loan_status
loan_id
LP1011        Y             Y    5417   267.4          City           Y
LP1020        Y             N   12841   349.3        Suburb           N
LP1043        Y             N    7660   104.1          City           N
LP1046        Y             N    5955   315.5          City           Y
LP1066        Y             Y    9560   191.1        Suburb           Y
...         ...           ...     ...     ...           ...         ...
LP2948        Y             N    5780   192.9          City           Y
LP2953        Y             N    5703   128.5          City           Y
LP2959        Y             N   12000   497.0        Suburb           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[120 rows x 6 columns]

In [13]:
loan_df[condition1 | condition2]

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2964        Y             N    3987   157.3         Rural           Y
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[442 rows x 6 columns]

In [14]:
loan_df[(loan_df['married'] == 'Y') | (loan_df['income'] > loan_df['income'].mean())]

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2964        Y             N    3987   157.3         Rural           Y
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[442 rows x 6 columns]

In [18]:
# 결혼을 했거나, 수입이 전체 평균보다 크고, 부동산이 도시에 있지 않다.

In [19]:
condition3 = loan_df['property_area'] == 'City'

In [20]:
loan_df[condition1 | condition2 & ~condition3]

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1011        Y             Y    5417   267.4          City           Y
LP1013        Y             N    2333    95.3          City           Y
...         ...           ...     ...     ...           ...         ...
LP2964        Y             N    3987   157.3         Rural           Y
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y

[426 rows x 6 columns]

In [21]:
# 데이터 삭제하기

In [22]:
loan_df

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1006        Y             N    2583   120.5          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[600 rows x 6 columns]

In [23]:
loan_df = loan_df.drop('LP1006')

In [24]:
loan_df

        married self_employed  income  amount property_area loan_status
loan_id
LP1003        Y             N    4583   128.4         Rural           N
LP1005        Y             Y    3000    66.0          City           Y
LP1008        N             N    6000   141.4          City           Y
LP1011        Y             Y    5417   267.4          City           Y
LP1013        Y             N    2333    95.3          City           Y
...         ...           ...     ...     ...           ...         ...
LP2974        Y             N    3232   108.6         Rural           Y
LP2979        Y             N    4106    40.7         Rural           Y
LP2983        Y             N    8072   253.4          City           Y
LP2984        Y             N    7583   187.6          City           Y
LP2990        N             Y    4583   133.2        Suburb           N

[599 rows x 6 columns]

In [29]:
# 데이터 내보내기

In [25]:
loan_df.to_csv('data/loan1.csv')

In [27]:
loan1_df = pd.read_csv('data/loan1.csv')

In [28]:
loan1_df

    loan_id married self_employed  income  amount property_area loan_status
0    LP1003       Y             N    4583   128.4         Rural           N
1    LP1005       Y             Y    3000    66.0          City           Y
2    LP1008       N             N    6000   141.4          City           Y
3    LP1011       Y             Y    5417   267.4          City           Y
4    LP1013       Y             N    2333    95.3          City           Y
..      ...     ...           ...     ...     ...           ...         ...
594  LP2974       Y             N    3232   108.6         Rural           Y
595  LP2979       Y             N    4106    40.7         Rural           Y
596  LP2983       Y             N    8072   253.4          City           Y
597  LP2984       Y             N    7583   187.6          City           Y
598  LP2990       N             Y    4583   133.2        Suburb           N

[599 rows x 7 columns]

In [30]:
loan1_df.to_csv('data/loan2.csv')

In [31]:
loan2_df = pd.read_csv('data/loan2.csv')

In [32]:
loan2_df

,Unnamed: 0,loan_id,married,self_employed,income,amount,property_area,loan_status
0,0,LP1003,Y,N,4583,128.4,Rural,N
1,1,LP1005,Y,Y,3000,66.0,City,Y
2,2,LP1008,N,N,6000,141.4,City,Y
3,3,LP1011,Y,Y,5417,267.4,City,Y
4,4,LP1013,Y,N,2333,95.3,City,Y
...,...,...,...,...,...,...,...,...
594,594,LP2974,Y,N,3232,108.6,Rural,Y
595,595,LP2979,Y,N,4106,40.7,Rural,Y
596,596,LP2983,Y,N,8072,253.4,City,Y
597,597,LP2984,Y,N,7583,187.6,City,Y
598,598,LP2990,N,Y,4583,133.2,Suburb,N

In [34]:
loan1_df.to_csv('data/loan3.csv', index=False)

In [36]:
loan3_df = pd.read_csv('data/loan3.csv')

In [37]:
loan3_df

    loan_id married self_employed  income  amount property_area loan_status
0    LP1003       Y             N    4583   128.4         Rural           N
1    LP1005       Y             Y    3000    66.0          City           Y
2    LP1008       N             N    6000   141.4          City           Y
3    LP1011       Y             Y    5417   267.4          City           Y
4    LP1013       Y             N    2333    95.3          City           Y
..      ...     ...           ...     ...     ...           ...         ...
594  LP2974       Y             N    3232   108.6         Rural           Y
595  LP2979       Y             N    4106    40.7         Rural           Y
596  LP2983       Y             N    8072   253.4          City           Y
597  LP2984       Y             N    7583   187.6          City           Y
598  LP2990       N             Y    4583   133.2        Suburb           N

[599 rows x 7 columns]

In [38]:
loan1_df.to_excel('data/loan1.xlsx')